Foundation-Devices/passport-firmware/ports/stm32/boards/Passport/common/se.c
// SPDX-FileCopyrightText: 2020 Foundation Devices, Inc. <hello@foundationdevices.com>
// SPDX-License-Identifier: GPL-3.0-or-later
//
// SPDX-FileCopyrightText: 2018 Coinkite, Inc. <coldcardwallet.com>
// SPDX-License-Identifier: GPL-3.0-only
//
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <errno.h>

#include "stm32h7xx_hal.h"
#include "stm32h7xx_hal_uart.h"
#include "stm32h7xx_hal_uart_ex.h"

#include "delay.h"
#include "pprng.h"
#include "sha256.h"
#include "secrets.h"
#include "se.h"
#include "se-config.h"
#include "utils.h"

#ifndef PASSPORT_BOOTLOADER
#include "display.h"
#endif /* PASSPORT_BOOTLOADER */

/*
 * This bit should be defined in the STM32H7 header files but it is not...
 * somehow was missed. It is a valid bit in the interrupt status register
 * so we'll define it here so as not to mess with the micropython HAL
 * installation.
 */
#define UART_FLAG_RTOF                      ((uint32_t)0x00000800U)

// "one wire" is on PA0 aka. UART4
#define MY_UART         UART4

/* SE error codes */
#define SE_SUCCESS              0x00
#define SE_CHECKMAC_MISCOMPARE  0x01
#define SE_PARSE_ERROR          0x03
#define SE_ECC_FAULT            0x05
#define SE_SELF_TEST_ERROR      0x07
#define SE_EXECUTION_ERROR      0x0F
#define SE_WAKE_ACK             0x11
#define SE_WATCHDOG_EXPIRING    0xEE
#define SE_COMMS_ERROR          0xFF

/* SE extended error codes */
#define SE_EX_RETRY_OUT         0xE0

#define STATS(x)

static uint8_t last_error;

uint32_t crc_errors;
uint32_t not_ready_n;
uint32_t short_error;
uint32_t len_error;
uint32_t len_error_two;
uint32_t ln_retry;
uint32_t retry_out;
uint32_t wdgtimeout;

uint32_t rtof;
uint32_t rxne;
uint32_t notrxne;

const char *copyright_msg = "(C) 2020 Foundation Devices Inc.";

static seopcode_t current_opcode;

// Bit patterns to be sent
#define BIT0    0x7d
#define BIT1    0x7f

// These control the direction of the single wire bus
typedef enum {
    IOFLAG_CMD      = 0x77,
    IOFLAG_TX       = 0x88,
    IOFLAG_IDLE     = 0xBB,
    IOFLAG_SLEEP    = 0xCC,
} ioflag_t;

#ifndef PASSPORT_BOOTLOADER
static char se_error[23];
static char *error_to_str(uint8_t error)
{
    switch (error)
    {
        case SE_SUCCESS:              strcpy(se_error, "SE_SUCCESS"); break;
        case SE_CHECKMAC_MISCOMPARE:  strcpy(se_error, "SE_CHECKMAC_MISCOMPARE"); break;
        case SE_PARSE_ERROR:          strcpy(se_error, "SE_PARSE_ERROR"); break;
        case SE_ECC_FAULT:            strcpy(se_error, "SE_ECC_FAULT"); break;
        case SE_SELF_TEST_ERROR:      strcpy(se_error, "SE_SELF_TEST_ERROR"); break;
        case SE_EXECUTION_ERROR:      strcpy(se_error, "SE_EXECUTION_ERROR"); break;
        case SE_WAKE_ACK:             strcpy(se_error, "SE_WAKE_ACK"); break;
        case SE_WATCHDOG_EXPIRING:    strcpy(se_error, "SE_WATCHDOG_EXPIRING"); break;
        case SE_COMMS_ERROR:          strcpy(se_error, "SE_COMMS_ERROR"); break;
        case SE_EX_RETRY_OUT:         strcpy(se_error, "SE_EX_RETRY_OUT"); break;
        default:                      strcpy(se_error, "unknown error"); break;
    }
    return se_error;
}
#endif /* PASSPORT_BOOTLOADER */

uint8_t se_show_error(void)
{
    uint8_t error = last_error;
#ifndef PASSPORT_BOOTLOADER
    printf("[%s] last SE error: %s, (%02X)\n", __func__, error_to_str(last_error), last_error);
#endif /* PASSPORT_BOOTLOADER */
    last_error = 0;
    return error;
}

static inline void _send_byte(uint8_t ch)
{
    // reset timeout timer (Systick)
    uint32_t    ticks = 0;
    SysTick->VAL = 0;

    while (!(MY_UART->ISR & UART_FLAG_TXE)) {
        // busy-wait until able to send (no fifo?)
        if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) {
            // failsafe timeout
            ticks += 1;
            if(ticks > 10) break;
        }
    }
    MY_UART->TDR = ch;
}

static void _send_bits(uint8_t tx)
{
    // serialize and send one byte
    uint8_t     mask = 0x1;

    for (int i=0; i<8; i++, mask <<= 1) {
        uint8_t h = (tx & mask) ? BIT1 : BIT0;

        _send_byte(h);
    }
}

static void _send_serialized(const uint8_t *buf, int len)
{
    for (int i=0; i<len; i++) {
        _send_bits(buf[i]);
    }
}

// Return -1 in case of timeout, else one byte.
//
static inline int _read_byte(void)
{
    uint32_t    ticks = 0;

    // reset timeout timer (Systick)
    SysTick->VAL = 0;

    while (!(MY_UART->ISR & UART_FLAG_RXNE) && !(MY_UART->ISR & UART_FLAG_RTOF)) {
        // busy-waiting

        if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) {
            ticks += 1;
            if (ticks >= 5) {
                // a full Xms has been wasted; give up.

                // NOTE: this is a failsafe long timeout, not reached in
                // practise because the bit-time timeout from UART (RTOF)
                ++notrxne;
                return -1;
            }
        }
    }

    if (MY_UART->ISR & UART_FLAG_RXNE) {
        ++rxne;
        return MY_UART->RDR & 0x7f;
    }
    if (MY_UART->ISR & UART_FLAG_RTOF) {
        // "fast" timeout reached, clear flag
        ++rtof;
        MY_UART->ICR = USART_ICR_RTOCF;
    }

    return -1;
}

// Return a deserialized byte, or -1 for timeout.
//
static void deserialize(const uint8_t *from, int from_len, uint8_t *into, int max_into)
{
    while (from_len > 0) {
        uint8_t rv = 0, mask = 0x1;

        for (int i=0; i<8; i++, mask <<= 1) {
#if 1
            if ((from[i] ^ 0x7F) < 2)
                rv |= mask;
#else
            if (from[i] == BIT1) {
                rv |= mask;
            }
#endif
        }

        *(into++) = rv;
        from += 8;
        from_len -= 8;

        max_into --;
        if (max_into <= 0) break;
    }
}

static inline void _flush_rx(void)
{
    // reset timeout timer (Systick)
    SysTick->VAL = 0;

    while (!(MY_UART->ISR & UART_FLAG_TC)) {
        // wait for last bit(byte) to be serialized and sent

        if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) {
            // full 1ms has passed -- timeout.
            break;
        }
    }

