Foundation-Devices/passport-firmware/ports/stm32/boards/Passport/common/se.c
    // We actualy need this delay here!
    for (int i=0; i<48; i++) {
        __NOP();
    }

    // clear junk in rx buffer
    MY_UART->RQR = USART_RQR_RXFRQ;

    // clear overrun error
    // clear rx timeout flag
    // clear framing error
    MY_UART->ICR = USART_ICR_ORECF | USART_ICR_RTOCF | USART_ICR_FECF;
}

// Read upto N bytes of response. Suspress echo of 0x88 and
// return actual number of (deserialized) bytes received.
// We ignore extra bytes not expected, and always read until a timeout.
// Cmds to chip can be up to 155 bytes, but not clear what max len for responses.
//
static int se_read_response(uint8_t *buf, int max_len)
{
    int max_expect = (max_len+1) * 8;
    uint8_t raw[max_expect];

    // tell chip to write stuff to bus
    _send_bits(IOFLAG_TX);

    // kill first byte which we expect to be IOFLAG_TX echo (0x88)
    _flush_rx();

    // It takes between 64 and 131us (tTURNAROUND) for the chip to recover
    // and start sending bits to us. We're blocked on reading
    // them anyway, so no need to delay. Also a danger of overruns here.

    int actual = 0;
    for (uint8_t *p = raw; ; actual++) {
        int ch = _read_byte();
        if (ch < 0) {
            break;
        }

        if (actual < max_expect) {
            *(p++) = ch;
        }
    }

    // Sometimes our framing is not perfect.
    // We might get a spurious bit at the leading edge (perhaps an echo
    // of part of the 0x88??) or junk at the end.
    actual &= ~7;
    deserialize(raw, actual, buf, max_len);

    return actual / 8;
}

static bool check_crc(const uint8_t *data, uint8_t length)
{
    uint8_t obs[2] = { 0, 0 };

    if (data[0] != length) {
        // length is wrong
        return false;
    }

    se_crc16_chain(length-2, data, obs);

    return (obs[0] == data[length-2] && obs[1] == data[length-1]);
}

void se_write(seopcode_t opcode, uint8_t p1, uint16_t p2, uint8_t *data, uint8_t data_len)
{
    // all commands will have this fixed header, which includes just one layer of framing
    struct {
        uint8_t	ioflag;
        uint8_t	framed_len;
        uint8_t	op;
        uint8_t	p1;
        uint8_t	p2_lsb;
        uint8_t	p2_msb;
    } known = {
        .ioflag = IOFLAG_CMD,
        .framed_len = (data_len + 7),		// 7 = (1 len) + (4 bytes of msg) + (2 crc)
        .op = opcode,
        .p1 = p1,
        .p2_lsb = p2 & 0xff,
        .p2_msb = (p2 >> 8) & 0xff,
    };
    STATS(last_op = opcode);
    STATS(last_p1 = p1);
    STATS(last_p2 = p2);

    current_opcode = opcode;

    /*
     * Wake up the chip...
     * If it was in sleep mode it starts the watchdog.
     * If it was in idle mode it resumes the watchdog.
     */
    se_wake();

    _send_serialized((const uint8_t *)&known, sizeof(known));

    // CRC will start from frame_len onwards
    uint8_t crc[2] = {0, 0};
    se_crc16_chain(sizeof(known)-1, &known.framed_len, crc);

    // insert a variable-length body area (sometimes)
    if (data_len) {
        _send_serialized(data, data_len);

        se_crc16_chain(data_len, data, crc);
    }

    // send final CRC bytes
    _send_serialized(crc, 2);
}

int se_read(uint8_t *data, uint8_t len)
{
    uint8_t tmp[1 + len + 2]; /* msg length + data length + checksum length */
    int retry;

    for (retry=100; retry >= 0; retry--) {
        int actual;

        actual = se_read_response(tmp, len+3);
        if (actual < 4) {
            if (actual == 0) {
                /* No data...probably still processing the command */
                ERR("not ready2");
                not_ready_n++;
            } else {
                // a weird short-read? probably fatal, but retry
                ERR("too short");
                short_error++;
            }
            goto try_again;
        }

        /*
         * The OP_Info response does not follow the normal response
         * format that includes a length and checksum. So we'll bypass
         * the length and checksum processing for the info command.
         */
        if (current_opcode != OP_Info)
        {
            uint8_t resp_len = tmp[0];
            if (resp_len != (len + 3)) {
                len_error++;
                if (resp_len == 4) {
                    /* Error code returned */
                    ERRV(tmp[1], "se errcode");
                    len_error_two++;

                    if (tmp[1] == 0xEE)
                        wdgtimeout++;

                    last_error = tmp[1];
                    goto out;
                }
                ERRV(tmp[0], "wr len");
                goto try_again;
            }

            if (!check_crc(tmp, actual)) {
                ERR("bad crc");
                crc_errors++;
                last_error = SE_COMMS_ERROR;
                goto try_again;
            }
        }

        memcpy(data, tmp + 1, actual - 3);

        /*
         * Pause the watchdog in case there's more to do
         * NOTE: Requires a wake commmand to resume!
         */
        _send_bits(IOFLAG_IDLE);

        return 0;

try_again:
        ln_retry++;
    }
    retry_out++;
    last_error = SE_EX_RETRY_OUT;

out:
    se_show_error();
    return -1;
}

int se_read1(void)
{
    int rc;
    uint8_t data;

    rc = se_read(&data, 1);
    if (rc < 0)
        return -1;
    return data;
}

int se_read_data_slot(int slot_num, uint8_t *data, int len)
{
    int rc;
    int rval = 0;
#ifdef FIXME
    ASSERT((len == 4) || (len == 32) || (len == 72));
#endif
    // zone => data
    // only reading first block of 32 bytes. ignore the rest
    se_write(OP_Read, (len == 4 ? 0x00 : 0x80) | 2, (slot_num<<3), NULL, 0);
    rc = se_read(data, (len == 4) ? 4 : 32);
    if (rc < 0)
    {
        rval = -1;
        goto out;
    }

    if (len == 72) {
        // read second block
        se_write(OP_Read, 0x82, (1<<8) | (slot_num<<3), NULL, 0);
        rc = se_read(data+32, 32);
        if (rc < 0)
        {
            rval = -1;
            goto out;
        }

        // read third block, but only using part of it
        uint8_t     tmp[32];
        se_write(OP_Read, 0x82, (2<<8) | (slot_num<<3), NULL, 0);
        rc = se_read(tmp, 32);
        if (rc < 0)
        {
            rval = -1;
            goto out;
        }

