Foundation-Devices/passport-firmware/ports/stm32/boards/Passport/common/se.c
    uint8_t sn8 = 0xEE;
    sha256_update(&ctx, &sn8, 1);
    sha256_update(&ctx, &od[7], 4);

    uint8_t sn01[2] = { 0x01, 0x23 };
    sha256_update(&ctx, sn01, 2);
    sha256_update(&ctx, &od[11], 2);

    // format the request body
    struct {
        uint8_t		ch3[32];		// not actually used, but has to be there
        uint8_t		resp[32];
        uint8_t		od[13];
    } req;

    // content doesn't matter, but nice and visible:
    memcpy(req.ch3, copyright_msg, 32);

    sha256_final(&ctx, req.resp);
    memcpy(req.od, od, 13);

    // Give our answer to the chip. The 0x01 means that TempKey holds
    // the second 32 byte value. First 32 byte value is in key slot 1 (pairing secret).
    se_write(OP_CheckMac, 0x01, keynum, (uint8_t *)&req, sizeof(req));
    rc = se_read1();
    se_sleep();
    if (rc != 0) {
        // did it work?! No.
        if (rc == SE_CHECKMAC_FAIL)
            ERR("CM fail");				// typical case: our hashs don't match
        else
            ERRV(rc, "CheckMac");
        return -2;
    }

    return 0;
}

// Check the chip produces a hash over various things the same way we would
// meaning that we both know the shared secret and the state of stuff in
// the 508a is what we expect.
//
int se_checkmac_hard(
    uint8_t keynum,
    const uint8_t *secret
)
{
    int rc;
    uint8_t     digest[32];

    rc = se_gendig_slot(keynum, secret, digest);
    if (rc < 0)
        return -1;

    // NOTE: we use this sometimes when we know the value is wrong, like
    // checking for blank pin codes... so not a huge error/security issue
    // if wrong here.
    if (!se_is_correct_tempkey(digest))
        return -2;

    return 0;
}

static int se_encrypted_read32(
    int data_slot,
    int blk,
    int read_kn,
    const uint8_t *read_key,
    uint8_t *data
)
{
    int rc;
    uint8_t digest[32];

    rc = se_pair_unlock();
    if (rc < 0)
        return -1;

    rc = se_gendig_slot(read_kn, read_key, digest);
    if (rc < 0)
        return -1;

    // read nth 32-byte "block"
    se_write(OP_Read, 0x82, (blk << 8) | (data_slot<<3), NULL, 0);
    rc = se_read(data, 32);
    se_sleep();
    if (rc < 0)
        return -1;

    xor_mixin(data, digest, 32);

    return 0;
}

int se_encrypted_read(
    int data_slot,
    int read_kn,
    const uint8_t *read_key,
    uint8_t *data,
    int len
)
{
    int rc;
#ifdef FIXME
    // not clear if chip supports 4-byte encrypted reads
    ASSERT((len == 32) || (len == 72));
#endif
    rc = se_encrypted_read32(data_slot, 0, read_kn, read_key, data);
    if (rc < 0)
        return -1;

    if (len == 32)
        return 0;

    rc = se_encrypted_read32(data_slot, 1, read_kn, read_key, data+32);
    if (rc < 0)
        return -1;

    uint8_t tmp[32];
    rc = se_encrypted_read32(data_slot, 2, read_kn, read_key, tmp);
    if (rc < 0)
        return -1;

    memcpy(data+64, tmp, 72-64);

    return 0;
}

static int se_encrypted_write32(
    int data_slot,
    int blk,
    int write_kn,
    const uint8_t *write_key,
    const uint8_t *data)
{
    int rc;
    uint8_t digest[32];

    rc = se_pair_unlock();
    if (rc < 0)
        return -1;

    // generate a hash over shared secret and rng
    rc = se_gendig_slot(write_kn, write_key, digest);
    if (rc < 0)
        return -1;

    // encrypt the data to be written, and append an authenticating MAC
    uint8_t body[32 + 32];

    for (int i=0; i<32; i++) {
        body[i] = data[i] ^ digest[i];
    }

    // make auth-mac to go with
    //	SHA-256(TempKey, Opcode, Param1, Param2, SN<8>, SN<0:1>, <25 bytes of zeros>, PlainTextData)
    //	msg = (dig
    //	    + ustruct.pack('<bbH', OP.Write, args['p1'], args['p2'])
    //	    + b'\xee\x01\x23'
    //	    + (b'\0'*25)
    //	    + new_value)
    //	assert len(msg) == 32+1+1+2+1+2+25+32
    //
    SHA256_CTX ctx;
    sha256_init(&ctx);

    uint8_t p1 = 0x80|2;        // 32 bytes into a data slot
    uint8_t p2_lsb = (data_slot << 3);
    uint8_t p2_msb = blk;

    uint8_t args[7] = { OP_Write, p1, p2_lsb, p2_msb, 0xEE, 0x01, 0x23 };
    uint8_t zeros[25] = { 0 };

    sha256_update(&ctx, digest, 32);
    sha256_update(&ctx, args, sizeof(args));
    sha256_update(&ctx, zeros, sizeof(zeros));
    sha256_update(&ctx, data, 32);

    sha256_final(&ctx, &body[32]);

    se_write(OP_Write, p1, (p2_msb << 8) | p2_lsb, body, sizeof(body));
    rc = se_read1();
    se_sleep();
    if (rc != 0)
        return -1;

    return 0;
}

int se_encrypted_write(
    int data_slot,
    int write_kn,
    const uint8_t *write_key,
    const uint8_t *data,
    int len
)
{
    for (int blk=0; blk<3 && len>0; blk++, len-=32) {
        int here = MIN(32, len);

        // be nice and don't read past end of input buffer
        uint8_t     tmp[32] = { 0 };
        memcpy(tmp, data+(32*blk), here);

        int rv = se_encrypted_write32(data_slot, blk, write_kn, write_key, tmp);
        if (rv < 0)
            return -1;
    }

    return 0;
}

void se_dump_stats(void)
{
    uint32_t tmp;

    tmp = crc_errors;
    tmp += not_ready_n;
    tmp += short_error;
    tmp += len_error;
    tmp += len_error_two;
    tmp += ln_retry;
    tmp += retry_out;
    tmp += rxne;
    tmp += rtof;
    tmp += notrxne;
    if (tmp > 0)
        tmp = 0;
}

#define SE_BAUDRATE 230400U

void se_setup(void)
{
   /*
    * MY_UART is pointer to USART_Typedef struct
    */
    GPIO_InitTypeDef gpiosetup = {0};
    uint32_t uartdiv;
    uint32_t uart_clock_prescaler = 0;

    /* Calculate the baud rate divisor */
    uartdiv = (uint16_t)(UART_DIV_SAMPLING16(HAL_RCC_GetPCLK1Freq(), SE_BAUDRATE, uart_clock_prescaler));

#ifdef DEV_STATS
    memset(&stats, 0, sizeof(stats));
#endif
    // configure pin A0 to be AF8_UART4, PULL_NONE
    // configure pin D15 to be INPUT, PULL_NONE, OD for output
    gpiosetup.Pin = GPIO_PIN_15;
    gpiosetup.Mode = GPIO_MODE_INPUT;
    gpiosetup.Pull = GPIO_NOPULL;
    gpiosetup.Speed = GPIO_SPEED_FREQ_MEDIUM;
    HAL_GPIO_Init(GPIOD, &gpiosetup);

    gpiosetup.Pin = GPIO_PIN_0;
    gpiosetup.Mode = GPIO_MODE_AF_OD;
    gpiosetup.Pull = GPIO_NOPULL;
    gpiosetup.Speed = GPIO_SPEED_FREQ_MEDIUM;
    gpiosetup.Alternate = GPIO_AF8_UART4;
    HAL_GPIO_Init(GPIOA, &gpiosetup);

    // enable clock to that part of chip
    __HAL_RCC_UART4_CLK_ENABLE();

    // copy config values from a running system, setup by mpy code
    // - except disable all interrupts
    // - mpy code will have to clean this up, see ...reinit() member func
    //
    // For max clock error insensitivity:
    // OVER8==0, ONEBIT=1

    // disable UART so some other bits can be set (only while disabled)

    MY_UART->CR1 = 0;
    MY_UART->CR1 = 0x1000002d & ~(0
                                  | USART_CR1_PEIE
                                  | USART_CR1_TXEIE
                                  | USART_CR1_TCIE
                                  | USART_CR1_RXNEIE
                                  | USART_CR1_IDLEIE
                                  | USART_CR1_OVER8
                                  | USART_CR1_UE);

    MY_UART->RTOR = 24;                  // timeout in bit periods: 3 chars or so
    MY_UART->CR2 = USART_CR2_RTOEN;      // rx timeout enable
    MY_UART->CR3 = USART_CR3_HDSEL | USART_CR3_ONEBIT;
    MY_UART->BRR = uartdiv; // 0x00000052;  // Value from HAL calcualtion above  for 230400 bps

    // clear rx timeout flag
    MY_UART->ICR = USART_ICR_RTOCF;

    // finally enable UART
    MY_UART->CR1 |= USART_CR1_UE;
}

// Just read a one-way counter.
//
int se_get_counter(uint32_t *result, uint8_t counter_number)
{
    int rc;

    se_write(OP_Counter, 0x0, counter_number, NULL, 0);
    rc = se_read((uint8_t *)result, 4);
    se_sleep();
    if (rc < 0)
        return -1;

    // IMPORTANT: Always verify the counter's value because otherwise
    // nothing prevents an active MitM changing the value that we think
    // we just read.
    uint8_t     digest[32];
    rc = se_gendig_counter(counter_number, *result, digest);
    if (rc < 0)
        return -1;

