Foundation-Devices/passport-firmware/ports/stm32/boards/Passport/common/se.c
    if (!se_is_correct_tempkey(digest))
        return -1;

    return 0;
}

// Add-to and return a one-way counter's value. Have to go up in
// single-unit steps, but can we loop.
//
int se_add_counter(uint32_t *result, uint8_t counter_number, int incr)
{
    int rc;
    int rval = 0;

    for (int i = 0; i < incr; i++) {
        se_write(OP_Counter, 0x1, counter_number, NULL, 0);
        rc = se_read((uint8_t *)result, 4);
        if (rc < 0)
        {
            rval = -1;
            goto out;
        }
    }

    // IMPORTANT: Always verify the counter's value because otherwise
    // nothing prevents an active MitM changing the value that we think
    // we just read. They could also stop us from incrementing the counter.

    uint8_t     digest[32];
    rc = se_gendig_counter(counter_number, *result, digest);
    if (rc < 0)
    {
        rval = -1;
        goto out;
    }

    if (!se_is_correct_tempkey(digest))
        rval = -1;

out:
    se_sleep();
    return rval;
}

// Construct a digest over one of the two counters. Track what we think
// the digest should be, and ask the chip to do the same. Verify we match
// using MAC command (done elsewhere).
//
int se_gendig_counter(int counter_num, const uint32_t expected_value, uint8_t digest[32])
{
    int rc;
    uint8_t num_in[20], tempkey[32];

    rng_buffer(num_in, sizeof(num_in));

    rc = se_pick_nonce(num_in, tempkey);
    if (rc < 0)
        return -1;

    //using Zone=4="Counter" => "KeyID specifies the monotonic counter ID"
    se_write(OP_GenDig, 0x4, counter_num, NULL, 0);
    rc = se_read1();
    se_sleep();
    if (rc != 0)
        return -1;

    // we now have to match the digesting (hashing) that has happened on
    // the chip. No feedback at this point if it's right tho.
    //
    //   msg = hkey + b'\x15\x02' + ustruct.pack("<H", slot_num)
    //   msg += b'\xee\x01\x23' + (b'\0'*25) + challenge
    //   assert len(msg) == 32+1+1+2+1+2+25+32
    //
    SHA256_CTX ctx;
    sha256_init(&ctx);

    uint8_t zeros[32] = { 0 };
    uint8_t args[8] = { OP_GenDig, 0x4, counter_num, 0,  0xEE, 0x01, 0x23, 0x0 };

    sha256_update(&ctx, zeros, 32);
    sha256_update(&ctx, args, sizeof(args));
    sha256_update(&ctx, (const uint8_t *)&expected_value, 4);
    sha256_update(&ctx, zeros, 20);
    sha256_update(&ctx, tempkey, 32);
    sha256_final(&ctx, digest);

    return 0;
}
